---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousrailJoinTypeParam
source: html/a89eee4c-0c30-4915-61db-a9d234e5d949.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousrailJoinTypeParam Property

"Rail Path Join"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailJoinTypeParam { get; }
```